multiple.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cal="http://localhost/soap-service/calculator">
   <soapenv:Header/>
   <soapenv:Body>
      <cal:multipleRequest>
         <num1>2</num1>
         <num2>10</num2>
      </cal:multipleRequest>
   </soapenv:Body>
</soapenv:Envelope>
